# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'heroku/brew'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'bat'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development
brew 'gcc'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'mycli'
brew 'pgcli'
brew 'datasette'
brew 'sqlite-utils'
brew 'sqlite'
brew 'pre-commit'
brew 'z'
brew 'pandoc'
brew 'heroku'
brew 'hugo'
brew 'graphviz'
brew 'pipx'
brew 'openssl'
brew 'node'
brew 'act'
brew 'wget'
brew 'croc'
brew 'tldr'
brew 'terminal-notifier'
brew 'thefuck'

# Apps
cask '1password'
cask '1password-cli'
cask 'caffeine'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'signal'
cask 'slack'
cask 'the-unarchiver'
cask 'transmission'
cask 'transmit'
# cask 'tunnelbear'
cask 'rectangle'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'
cask 'inkscape'
cask 'mendeley'
cask 'macdown'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'jupyter-notebook-viewer'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Spark', id: 1176895641
mas 'Speedtest', id: 1153157709
mas 'AdBlock', id: 1402042596
mas 'Grammarly for Safar', id: 1462114288
